{
  "projects": {
    "0": {
      "description": "<p>A responsive single page application with a RESTful API service.</p><p>The idea for this student project came from hearing about the need for car enthusiasts and hobbyists to swap parts. This app allows for listing parts to sell, as well as searching on available inventory.</p>",
      "github": "https://github.com/christylaguardia/garage-fellows",
      "image": "garagefellows.png",
      "tags": [
        "JavaScript",
        "NodeJS",
        "ExpressJS",
        "Responsive Web Design",
        "PostgreSQL",
        "jQuery",
        "HTML5",
        "CSS3"
      ],
      "title": "Garage Fellows",
      "url": "https://garagefellows.herokuapp.com/"
    },
    "1": {
      "description": "<p>Secure App is an authentication security solution for implementation on the back-end of NodeJS web apps.</p><p>Utilizing the extensive knowledge base provided through the <a href='https://www.sqreen.io/developers.html'>Sqreen API service,</a> this app finds potential security risks during authentication and blocks threats. Signup or signin attempts from known or custom blacklists are tracked. Email and IP addresses implicated are saved in meaningful event logging.</p>",
      "github": "https://github.com/ACL-CMS-P1/carret",
      "image": "secureapp.png",
      "tags": [
        "JavaScript",
        "NodeJS",
        "ExpressJS",
        "TDD",
        "Jest",
        "MocahJS",
        "ChaiJS",
        "MongoDB",
        "Mongoose"
      ],
      "title": "Secure App"
    },
    "2": {
      "description": "<p>A social network platform for student athletes. Built for a local startup.</p>Our client wanted to create a social media application that would connect high school and college athletes with recruiters and other professional contacts. Think of it as a LinkedIn for student athletes. My team and I created a proof of concept for our client to gain approval to a startup incubator program.<p>",
      "github": "https://github.com/varcity-network",
      "image": "varcity.png",
      "tags": [
        "JavaScript",
        "NodeJS",
        "ExpressJS",
        "React",
        "Redux",
        "TDD",
        "Jest",
        "MocahJS",
        "ChaiJS",
        "Bulma",
        "MongoDB",
        "Mongoose"
      ],
      "title": "Varcity Network",
      "url": "https://varcity-network.herokuapp.com/"
    }
  }
}